Revit 2026 API

# DividedPathSetIntersectingElements Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetIntersectingElements(
	ICollection<ElementId> intersectors
)
```
```vb
Public Sub SetIntersectingElements (
	intersectors As ICollection(Of ElementId)
)
```
```cpp
public:
void SetIntersectingElements(
	ICollection<ElementId^>^ intersectors
)
```
```fsharp
member SetIntersectingElements :
        intersectors : ICollection<ElementId> -> unit
```

#### Parameters

intersectors ICollectionElementId

#### Reference

DividedPath Class

Autodesk.Revit.DB Namespace